name: "test-mask-layer"

input: "data"
input_dim: 1
input_dim: 3
input_dim: 4
input_dim: 4

input : "mask"
input_dim: 1
input_dim: 1
input_dim: 4
input_dim: 4

layer {
    bottom: "data"
    bottom: "mask"
    top: "masked"
    type: "Mask"
}